# IFCParameter Template Set Active Template Method

Source: https://www.revitapidocs.com/2026/8a7cf78a-4f06-ed67-79f4-4d16322a5e04.htm

---

| IFCParameter Template Set Active Template Method |
| --- |

Sets the mapping template element to be the active mapping template for its document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetActiveTemplate()
```

```
Public Sub SetActiveTemplate
```

```
public:
void SetActiveTemplate()
```

```
member SetActiveTemplate : unit -> unit
```
Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Invalid use of in\-session template. |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace